// 1. Створіть змінну з ім'ям `name` і присвойте їй ваше ім'я. Виведіть це ім'я в
//    консоль.

// 2. Створіть змінну `age` і присвойте їй ваш вік. Виведіть в консоль рядок, що
//    містить ваш вік у такому форматі: "Мені {вік} років".

// 3. Створіть змінні `x` і `y` і присвойте їм довільні числа. Виведіть в консоль
//    результати додавання, віднімання, множення та ділення цих чисел.

// 4. Створіть змінну `city` і присвойте їй назву вашого міста. Створіть рядок,
//    який містить "Я живу в місті {назва міста}", і виведіть його в консоль.

// 5. Створіть рядок з вашою електронною поштою. Використайте методи рядка, щоб
//    витягнути ваше ім'я та доменну частину. Виведіть обидва ці значення в
//    консоль.

// 6. Створіть змінну `price` і присвойте їй число. Створіть рядок, що містить ціну
//    з символом гривні, наприклад: "Ціна: 500 грн".

// 7. Створіть змінну `isLogged`, яка має булеве значення. Виведіть в консоль
//    повідомлення "Користувач авторизований", якщо `isLogged` дорівнює `true`, і
//    "Користувач неавторизований", якщо `isLogged` дорівнює `false`.

// !111111111111111
const myName = "Anna";
console.log(myName);

// !222222222222222
const myAge = 35;
console.log(`Мені ${myAge} років`);

// !333333333333333
let x = 50;
let y = 18;
console.log(x - y);
console.log(x + y);
console.log(Math.floor(x / y));
console.log(Math.ceil(x / y));
console.log(Math.round(x / y));
console.log((x / y).toFixed(1));
console.log((x / y).toFixed(2));
console.log((x / y).toFixed(3));
console.log(x * y);

// !444444444444444
const myCity = "Wroclaw";
let message = `Я живу во ${myCity}!`;
console.log(message);

// !555555555555555