// 🟢 Задача 1. Площа прямокутника
// Створи функцію calcRectangleArea(width, height), яка приймає ширину 
// і висоту прямокутника у вигляді рядків.
// У рядках може бути кома або крапка як десятковий роздільник.
// Функція повинна:
// замінити кому на крапку (якщо вона є);
// перетворити значення в числа;
// обчислити площу прямокутника за формулою ширина × висота;
// повернути результат, округлений до двох знаків після коми.

function calcRectangleArea(width, height) {    
    //заміняємо кому на крапку
    const w = width.replace(',', '.');
    const h = height.replace(',', '.');

    // перетворюємо рядки в числа
    const wNumber = parseFloat(w); //число ширини
    const hNumber = parseFloat(h); //число висоти

    //обчислити площу прямокутника за формулою ширина × висота; округлюємо
    return (wNumber * hNumber).toFixed(2);
}
//передаємо параметри
const square = calcRectangleArea('12.85', '20,255');
console.log(square);

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

// 🟢Задача 2. Середнє арифметичне
// Створи функцію calcAverage(a, b, c), яка приймає три значення у вигляді рядків.
// Кожне значення може містити десяткові числа.
// Функція повинна:
// перетворити всі значення в числа;
// знайти середнє арифметичне;
// повернути результат, округлений до одного знака після коми.

function calcAverage(a, b, c) {

    //міняємо кому на крапку і перетворюємо на числа
    const an = parseFloat(a.replace(',', '.'));
    const bn = parseFloat(b.replace(',', '.'));
    const cn = parseFloat(c.replace(',', '.'));

    //знаходимо середнє арифметичне
    //округл. до одного знака після коми
    //перетворюємо на числа, бо .toFixed() знову перетворює на рядок
    return Number(((an + bn + cn) / 3).toFixed(1));
}
//передаємо параметри
const totalAverage = calcAverage('24.5', '18,44', '8.587');
console.log(totalAverage);

// 🟢 Задача 3. Периметр квадрата
// Створи функцію calcSquarePerimeter(side), яка приймає довжину сторони 
// квадрата у вигляді рядка.
// Функція повинна:
// перетворити рядок у число;
// обчислити периметр квадрата (4 × сторона);
// повернути результат як число.

function calcSquarePerimeter(side) {
    const sideNumber = parseFloat(side); //перетворюємо на число

    return sideNumber * 4; //обчислюємо периметр квадрата
    
}
const allTotal = calcSquarePerimeter(18); //передаємо параметр
console.log(allTotal);

// 🟢 Задача 4. Вартість покупки зі знижкою
// Створи функцію calcDiscountPrice(price, discount), де:
// price — ціна товару у вигляді рядка;
// discount — знижка у відсотках (також рядок).
// Функція повинна:
// перетворити значення в числа;
// обчислити фінальну ціну з урахуванням знижки;
// повернути результат, округлений до двох знаків після коми.

function calcDiscountPrice(price, discount) {
    const priceNumb = parseFloat(price); //перетворюємо на число ціну
    const discountNumb = parseFloat(discount); //перетворюємо на число знижку
    const totalPrice = (priceNumb * (1 - discountNumb / 100)).toFixed(2)
//обчислюємо фінальну ціну з урахуванням знижки;
    return Number(totalPrice); //повертаємо результат
}
const priceWithDiscount = calcDiscountPrice('158', '18'); //передаємо параметри
console.log(priceWithDiscount);

// 🟢 Задача 5. Переведення кілометрів у метри
// Створи функцію convertKmToM(km), яка приймає кількість кілометрів у вигляді рядка.
// Функція повинна:
// перетворити значення в число;
// перевести кілометри в метри;
// повернути результат як число.

function convertKmToM(km) {
    const kmNumb = parseFloat(km.replace(',', '.')); //перетвор на число і замін кому на крапку
    const metr = kmNumb * 1000; //переводимо КМ в Метри
    
    return metr; //повертаєморезультат
}
const kmToM = convertKmToM('18'); //передаємо параметри
console.log(kmToM);

// 🟢 Задача 6. Обʼєм куба
// Створи функцію calcCubeVolume(side), яка приймає довжину ребра куба у вигляді рядка.
// Функція повинна:
// перетворити значення в число;
// обчислити обʼєм куба за формулою side ** 3;
// повернути результат.

function calcCubeVolume(side) {
    const sideNumb = parseFloat(side.replace(',', '.')); //перетворюємо рядок на число і кому на крапку
    const cubeVolume = sideNumb ** 3; //застосовуємо формулу об'єма куба

    return cubeVolume; //повертаємо результат
}
const totalCubeVolume = calcCubeVolume('8'); //передаємо параметр
console.log(totalCubeVolume);

// 🟢 Задача 7. Швидкість руху
// Створи функцію calcSpeed(distance, time), де:
// distance — відстань у кілометрах (рядок);
// time — час у годинах (рядок).
// Функція повинна:
// перетворити значення в числа;
// знайти швидкість (distance / time);
// повернути результат, округлений до одного знака після коми.

function calcSpeed(distance, time) {
    const d = parseFloat(distance.replace(',', '.')); // перетвор рядок на число і кому на крапку
    const tHours = parseFloat(time.replace(',', '.')); // перетвор рядок на число і кому на крапку

      // 🔒 перевірка на 0
    if (tHours === 0) {
        console.log('Час не може бути 0');
    return null;
    }
    const speed = (d / tHours).toFixed(1); //знаходимо швидкість і округл до 1-го знака після коми
    return Number(speed); //повертаємо результат
}
const valueSpeed = calcSpeed('235', '2,45') //передаємо значення
console.log(valueSpeed);

// 🟢 Задача 8. Площа трикутника
// Створи функцію calcTriangleArea(base, height), яка приймає основу і висоту
// трикутника у вигляді рядків.
// Функція повинна:
// перетворити значення в числа;
// обчислити площу трикутника за формулою (base × height) / 2;
// повернути результат.

function calcTriangleArea(base, height) {
    const b = parseFloat(base.replace(',', '.')); //перетвор рядок на число і кому на крапку
    const h = parseFloat(height.replace(',', '.')); //перетвор рядок на число і кому на крапку

// 1️⃣ Перевірка на помилкові значення
// Якщо раптом передадуть 'abc' або порожній рядок:

if (isNaN(b) || isNaN(h)) {
  console.log('Некоректні дані');
  return null;
}

// 2️⃣ Перевірка, щоб числа були більше 0
if (b <= 0 || h <= 0) {
  console.log('Основа і висота мають бути більші за 0');
  return null;
}
    const triangleSquare = (b * h) / 2; //обчислюємо площу трикутника
    return triangleSquare; //повертаємо результат
}
const triangleArea = calcTriangleArea('8', '2,5'); //передаємо значення
console.log(triangleArea);

// 🟢 Задача 9. Конвертація температури
// Створи функцію convertCelsiusToFahrenheit(temp),
// яка приймає температуру в градусах Цельсія у вигляді рядка.
// Функція повинна:
// перетворити значення в число;
// перевести температуру у Фаренгейти за формулою (temp × 9 / 5) + 32;
// повернути результат, округлений до одного знака після коми.
function convertCelsiusToFahrenheit(temp) {
    const tempValue = parseFloat(temp.replace(',', '.')); //перетвор з рядка на число і кому на крапку

    // 1️⃣ Перевірка на помилкові значення
    // Якщо раптом передадуть 'abc' або порожній рядок:
    if (isNaN(tempValue)) {
        console.log(`Некоректні дані!`);
        return null;
    }
   
    const convertTempValue = ((tempValue * 9 / 5) + 32).toFixed(1); //підставл формулу для розрахунку і округл до 1-го знака
    return Number(convertTempValue); //повертаємо результат
}
const celsiusToFahrenheit = convertCelsiusToFahrenheit('18'); //передаємо значення
console.log(celsiusToFahrenheit);

// 🟢 Задача 10. Індекс маси тіла (спрощений)
// Створи функцію calcSimpleBMI(weight, height), яка приймає вагу і зріст у вигляді рядків.
// Функція повинна:
// перетворити значення в числа;
// обчислити BMI;
// повернути результат без округлення.
function calcSimpleBMI(weight, height) {
    const w = parseFloat(weight.replace(',', '.')); //перетвор рядок в цифри і коми в крапку
    const h = parseFloat(height.replace(',', '.')); //перетвор рядок в цифри і коми в крапки

    // 1️⃣ Перевірка на помилкові значення
    // Якщо раптом передадуть 'abc' або порожній рядок:
    if (isNaN(w) || isNaN(h)) {
        console.log(`Одне з значень некоректне!`);
        return null;
    }

    // 2️⃣ Перевірка, щоб числа були більше 0
    if (w <= 0 || h <= 0) {
        console.log(`Зріст або вага мають бути більщі за 0!`);
        return null;
    }

    const bmi = (w / h ** 2); //підставляємо формулу BMI
    return bmi; //повертаємо результат
}
const BMI = calcSimpleBMI('90,8', '1.784'); //підставл значення
console.log(BMI);