// 🟢 Задача 1. Площа прямокутника
// Створи функцію calcRectangleArea(width, height), яка приймає ширину 
// і висоту прямокутника у вигляді рядків.
// У рядках може бути кома або крапка як десятковий роздільник.
// Функція повинна:
// замінити кому на крапку (якщо вона є);
// перетворити значення в числа;
// обчислити площу прямокутника за формулою ширина × висота;
// повернути результат, округлений до двох знаків після коми.

function calcRectangleArea(width, height) {    
    //заміняємо кому на крапку
    const w = width.replace(',', '.');
    const h = height.replace(',', '.');

    // перетворюємо рядки в числа
    const wNumber = parseFloat(w); //число ширини
    const hNumber = parseFloat(h); //число висоти

    //обчислити площу прямокутника за формулою ширина × висота; округлюємо
    return (wNumber * hNumber).toFixed(2);
}
//передаємо параметри
const square = calcRectangleArea('12.85', '20,255');
console.log(square);

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

// 🟢Задача 2. Середнє арифметичне
// Створи функцію calcAverage(a, b, c), яка приймає три значення у вигляді рядків.
// Кожне значення може містити десяткові числа.
// Функція повинна:
// перетворити всі значення в числа;
// знайти середнє арифметичне;
// повернути результат, округлений до одного знака після коми.

function calcAverage(a, b, c) {

    //міняємо кому на крапку і перетворюємо на числа
    const an = parseFloat(a.replace(',', '.'));
    const bn = parseFloat(b.replace(',', '.'));
    const cn = parseFloat(c.replace(',', '.'));

    //знаходимо середнє арифметичне
    //округл. до одного знака після коми
    //перетворюємо на числа, бо .toFixed() знову перетворює на рядок
    return Number(((an + bn + cn) / 3).toFixed(1));
}
//передаємо параметри
const totalAverage = calcAverage('24.5', '18,44', '8.587');
console.log(totalAverage);

// 🟢 Задача 3. Периметр квадрата
// Створи функцію calcSquarePerimeter(side), яка приймає довжину сторони 
// квадрата у вигляді рядка.
// Функція повинна:
// перетворити рядок у число;
// обчислити периметр квадрата (4 × сторона);
// повернути результат як число.

function calcSquarePerimeter(side) {
    const sideNumber = parseFloat(side);

    return sideNumber * 4;
    
}
const allTotal = calcSquarePerimeter(18);
console.log(allTotal);

// 🟢 Задача 4. Вартість покупки зі знижкою
// Створи функцію calcDiscountPrice(price, discount), де:
// price — ціна товару у вигляді рядка;
// discount — знижка у відсотках (також рядок).
// Функція повинна:
// перетворити значення в числа;
// обчислити фінальну ціну з урахуванням знижки;
// повернути результат, округлений до двох знаків після коми.

function calcDiscountPrice(price, discount) {
    const priceNumb = parseFloat(price);
    const discountNumb = parseFloat(discount);
    const totalPrice = (priceNumb * (1 - discountNumb / 100)).toFixed(2)

    return Number(totalPrice);
}
const priceWithDiscount = calcDiscountPrice('158', '18');
console.log(priceWithDiscount);